Show / Hide Table of Contents
Class FoldedPlateData
Provides data of the folded plate
Inheritance
System.Object
FoldedPlateData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class FoldedPlateData
Properties
Improve this Doc   View Source
Bends
List of bends connected plates of foldedplate
Declaration
public List<BendData> Bends { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<BendData>
Improve this Doc   View Source
Plates
List of plates belong to folded plate
Declaration
public List<PlateData> Plates { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PlateData>
 Improve this Doc
 View Source